app/Http/Controllers/BookController.php

select exists(select * from `books` where `books`.`user_id` = '6965f254-a1d6-46f2-949d-bc2e112355b4' and `books`.`user_id` is not null) as `exists`
select `id`, `title`, `author`, `genre`, `read`, `pages` from `books` where `books`.`user_id` = '6965f254-a1d6-46f2-949d-bc2e112355b4' and `books`.`user_id` is not null and `title` like '%asdf%' or `author` like '%asdf%' order by `created_at` asc limit 20 offset 0
select count(*) as aggregate from `books` where `books`.`user_id` = '6965f254-a1d6-46f2-949d-bc2e112355b4' and `books`.`user_id` is not null and `title` like '%asdf%' or `author` like '%asdf%'
select `id`, `title`, `author`, `genre`, `read`, `pages` from `books` where `books`.`user_id` = '6965f254-a1d6-46f2-949d-bc2e112355b4' and `books`.`user_id` is not null and (`title` like '%ashl%' or `author` like '%ashl%') order by `created_at` asc limit 20 offset 0
---
    public function index(Request $request): Response
    {
        if (!auth()->user()->books()->exists()) {
            return Inertia::render('Books/Index', ['books' => []]);
        }

        $search = $request->query('search');

        // TODO: Re-do pagination
        if ($search) {
            $books = auth()->user()->books()
                ->select('id', 'title', 'author', 'genre', 'read', 'pages')
                ->where('title', 'like', '%' . $search . '%')
                ->orWhere('author', 'like', '%' . $search . '%')
                ->orderBy('created_at', 'asc')
                ->paginate(20);
        } else {
            $books = auth()->user()->books()
                ->select('id', 'title', 'author', 'genre', 'read', 'pages')
                ->orderBy('created_at', 'asc')
                ->paginate(20);
        }

        return Inertia::render('Books/Index', [
            'books' => $books,
            'success' => $request->session()->get('success'),
        ]);